import React from "react";

export default class Home extends React.Component
{
	render(){
		return (<div>
				<h1>Начало</h1>
				<h2>Здравейте и добре дошли в "Математика за всички"! </h2>
				
				<p>

				Ние сме Александър Бонин и Косьо Николов и  създадохме този сайт, в който могат автоматично да се генерират задачи по алгебра. Целта ни е да подпомогнем учителите в процеса на създаване на задачи за упражнение и контролни работи. Учениците, които искат да повишат нивото на своята подготовка по математика, също могат да използват нашия генератор.
				Промяната на стойностите на параметрите - "Степен", "Брой на елементите в скобите", "Вид на коефициентите", "Вид на корените" и други води до създаване на задачи от различен вид. Програмата може да покаже и отговорите на задачите, а Вие, скъпи потребители, трябва само да се престрашите.

				Приятно генериране!
				</p>
			</div>)
	}
}